app/controllers/posts_controller.rb

	def index
		@posts = Post.all.order('created_at DESC')
---
SELECT "posts".* FROM "posts" WHERE (title LIKE '%fourth post%')  ORDER BY created_at DESC

	def create
		@post = Post.new(post_params)
		@post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First post"], ["body", "this is first post"], ["created_at", "2016-08-15 04:36:12.855515"], ["updated_at", "2016-08-15 04:36:12.855515"]]